nxp-mcuxpresso/mcux-soc-svd/KW47B42ZB6/KW47B42ZB6_cm33_core0.xml
        <register>
          <name>CTRL1</name>
          <description>RXDIG Control 1</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x180</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_SAMPLE_BUF_BYPASS</name>
              <description>Bypass Sample Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_DFT_IQ_OUT_AVERAGED</name>
              <description>I/Q output as raw or averaged data</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_DFT_IQ_OUT_AVERAGED_0</name>
                  <description>Raw data at rx_dft_iq_out</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_DFT_IQ_OUT_AVERAGED_1</name>
                  <description>Averaged data at rx_dft_iq_out</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_IQ_AVG_WIN_PCT</name>
              <description>RX IQ Output Average Window Config to generate PCT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_IQ_AVG_WIN_PCT_0</name>
                  <description>Disable RX IQ output average function</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_IQ_AVG_WIN_PCT_1</name>
                  <description>Average window size = 4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_IQ_AVG_WIN_PCT_2</name>
                  <description>Average window size = 8</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_IQ_AVG_WIN_PCT_3</name>
                  <description>Average window size = 16</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_SAMPLE_BUF_BYPASS_IN_CTE</name>
              <description>Bypass Sample Buffer During CTE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_SAMPLE_BUF_AUTO_GATE</name>
              <description>Sample Buffer Automatically Gate Off</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DC_RESID_EN</name>
              <description>DC_RESID Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIS_WB_NORM_AA_FOUND</name>
              <description>Disable WB-NORM when AA found</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_NB_NORM_EN</name>
              <description>Narrow-Band Normalizer Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_NB_NORM_EN_0</name>
                  <description>Narrow-Band normalizer is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_NB_NORM_EN_1</name>
                  <description>Narrow-Band normalizer is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_HIGH_RES_NORM_SEL</name>
              <description>High Resolution Phase Source Select</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_HIGH_RES_NORM_SEL_0</name>
                  <description>From RX_NORM_NB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_HIGH_RES_NORM_SEL_1</name>
                  <description>From RX_NORM_WB</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_DEMOD_FILT_BYPASS</name>
              <description>Demod Channel Filter Bypass</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_DEMOD_FILT_BYPASS_0</name>
                  <description>Demod channel filter is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_DEMOD_FILT_BYPASS_1</name>
                  <description>Demod channel filter is bypassed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_DC_RES_AFTER_IF_MIX</name>
              <description>When programmed to 1, it moves the DC RESIDUAL block after the IF MIXER When 0, the DC RESIDUAL is between the DCOC and IQMC blocks</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_FRAC_CORR_OVRD</name>
              <description>Fractional Correction Coefficient Override Value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_FRAC_CORR_OVRD_EN</name>
              <description>Fractional Correction Coefficient Override Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_CFO_EST_OVRD</name>
              <description>CFO Estimation Override Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_CFO_EST_OVRD_EN</name>
              <description>CFO Estimation Override Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_CFO_EST_OVRD_EN_0</name>
                  <description>CFO override is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_CFO_EST_OVRD_EN_1</name>
                  <description>CFO override is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_MIXER_IDX_OUT_MODE</name>
              <description>RX_DIG Mixer Index Output Mode</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_IQ_PH_AVG_WIN</name>
              <description>RX IQ Phase Output Average Window Config</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_IQ_PH_AVG_WIN_0</name>
                  <description>Disable RX IQ and/or Phase output average function</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_IQ_PH_AVG_WIN_1</name>
                  <description>Average window size = 4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_IQ_PH_AVG_WIN_2</name>
                  <description>Average window size = 8</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_IQ_PH_AVG_WIN_3</name>
                  <description>Average window size = 16</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_IQ_PH_AVG_WIN_4</name>
                  <description>Average window size = 32</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_IQ_PH_AVG_WIN_5</name>
                  <description>Average window size = 64</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_IQ_PH_AVG_WIN_6</name>
                  <description>Average window size = 128</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_IQ_PH_AVG_WIN_7</name>
                  <description>Average window size = 256</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_IQ_PH_OUTPUT_COND</name>
              <description>RX IQ or Phase Output Conditioning</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_IQ_PH_OUTPUT_COND_0</name>
                  <description>Output IQ and/or Phase all-time</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_IQ_PH_OUTPUT_COND_1</name>
                  <description>Only output IQ and/or Phase during localization sample slot</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DFT_CTRL</name>
          <description>RXDIG DFT Control</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DFT_RX_PH_OUT_SEL</name>
              <description>DFT RXDIG Phase Output Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DFT_RX_PH_OUT_SEL_0</name>
                  <description>Disable DFT phase output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFT_RX_PH_OUT_SEL_1</name>
                  <description>Select wide-band phase output</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFT_RX_PH_OUT_SEL_2</name>
                  <description>Select narrow-band phase output</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFT_RX_PH_OUT_SEL_3</name>
                  <description>Disable DFT phase output</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFT_RX_IQ_OUT_SEL</name>
              <description>DFT I/Q Output Selection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DFT_RX_IQ_OUT_SEL_0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFT_RX_IQ_OUT_SEL_1</name>
                  <description>Select IF_MIXER</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFT_RX_IQ_OUT_SEL_2</name>
                  <description>Select CIC</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFT_RX_IQ_OUT_SEL_3</name>
                  <description>Select ACQ channel filter</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFT_RX_IQ_OUT_SEL_4</name>
                  <description>Select SRC</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFT_RX_IQ_OUT_SEL_5</name>
                  <description>Select CFO_MIXER</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFT_RX_IQ_OUT_SEL_6</name>
                  <description>Select FRAC_CORR</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFT_RX_IQ_OUT_SEL_7</name>
                  <description>Select DC_RESID</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFT_RSSI_MAG_OUT_SEL</name>
              <description>DFT RSSI Magnitude Output Selection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DFT_RSSI_MAG_OUT_SEL_0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFT_RSSI_MAG_OUT_SEL_1</name>
                  <description>WB-RSSI fast magnitude</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFT_RSSI_MAG_OUT_SEL_2</name>
                  <description>WB-RSSI slow magnitude</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFT_RSSI_MAG_OUT_SEL_3</name>
                  <description>NB-RSSI mag IIR</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFT_RSSI_MAG_OUT_SEL_4</name>
                  <description>NB-RSSI mag avg</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFT_RSSI_MAG_OUT_SEL_5</name>
                  <description>NB-RSSI noise mag IIR</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFT_RSSI_MAG_OUT_SEL_6</name>
                  <description>NB-RSSI noise mag avg</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFT_RSSI_MAG_OUT_SEL_7</name>
                  <description>DFT_RX_IQ_OUT mag</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFT_RSSI_OUT_SEL</name>
              <description>DFT RSSI Result Output Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DFT_RSSI_OUT_SEL_0</name>
                  <description>Disable RSSI output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFT_RSSI_OUT_SEL_1</name>
                  <description>Wide-band RSSI_RAW output</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFT_RSSI_OUT_SEL_2</name>
                  <description>Wide-band RSSI output</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFT_RSSI_OUT_SEL_3</name>
                  <description>Narrow-band RSSI_RAW output</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFT_RSSI_OUT_SEL_4</name>
                  <description>Narrow-band RSSI output</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFT_RSSI_OUT_SEL_5</name>
                  <description>Narrow-band NOISE_RAW output</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFT_RSSI_OUT_SEL_6</name>
                  <description>Narrow-band SNR output</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFT_RSSI_OUT_SEL_7</name>
                  <description>Narrow-band LQI output</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFT_RX_IQ_OUT_SAMPLE_BUF_OUT2</name>
              <description>Enable sample_buf output after delay line instead of src output for DFT RX_IQ_OUT</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DFT_RX_IQ_OUT_SAMPLE_BUF_OUT2_0</name>
                  <description>SRC output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFT_RX_IQ_OUT_SAMPLE_BUF_OUT2_1</name>
                  <description>SAMPLE BUF 2 output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CGM_OVRD</name>
              <description>CGM Override</description>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CGM_OVRD_1</name>
                  <description>RCCAL</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CGM_OVRD_2</name>
                  <description>DCOC</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CGM_OVRD_4</name>
                  <description>IF_MIXER</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CGM_OVRD_8</name>
                  <description>CIC</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CGM_OVRD_16</name>
                  <description>ACQ_CHF</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CGM_OVRD_32</name>
                  <description>SRC</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CGM_OVRD_64</name>
                  <description>SAMPLE_BUF and CFO_MIXER</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CGM_OVRD_128</name>
                  <description>DEMOD_CHF and FRAC_CORR</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CGM_OVRD_256</name>
                  <description>NB_NORM and HIGH_RES_NORM</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CGM_OVRD_512</name>
                  <description>AGC</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CGM_OVRD_1024</name>
                  <description>IQ_MISMATCH</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CGM_OVRD_2048</name>
                  <description>DIG_GAIN</description>
                  <value>0x800</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
